tests/gateway_load_tests.yml
config:
  target: "IC WebSocket Gateway"
  processor: "./dist/load/client.bundle.js"
  phases:
    - duration: 5
      arrivalRate: 1
    - duration: 30
      arrivalRate: 5
    - duration: 5
      arrivalRate: 1

scenarios:
  - name: "Client connects, sends messages and disconnects"
    flow:
      - function: "connectClient"
      - function: "sendMessages"
      - function: "disconnectClient"